code/openfoam/tutorials/incompressibleVoF/climbingRod/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;

    limited         cellLimited Gauss linear 1;
}

divSchemes
{
    div(rhoPhi,U)   Gauss linearUpwindV grad(U);

    div(phi,alpha)  Gauss interfaceCompression vanLeer 1;

    div(alphaPhi.liquid,sigma.liquid)   Gauss linearUpwind limited;

    div(alpha.liquid*sigma.liquid)    Gauss linear;
    div(alpha.liquid*nuM*grad(U))   Gauss linear;

    div(alpha.air*nuEff.air*dev2(T(grad(U)))) Gauss linear;
    div(alpha.liquid*nu.liquid*dev2(T(grad(U))))  Gauss linear;

    div(alpha.liquid*nu.liquid*dev(twoSymm(grad(U)))) Gauss linear;
    div(alpha.liquid*(nu.liquid+nuM)*grad(U)) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
